<template>
  <q-page class="flex flex-center">
    <q-card>
      <div class="main-panel">
        <q-card-section>
          <p align="center">
            <strong>
              Тема проекта: Создание социальной сети «Архитектоника» для
              архитекторов на основе современных технологий
            </strong>
          </p>
          <p>
            <strong>Цель работы:</strong>
            Разработать социальную сеть для архитекторов с помощью современных
            технологий
          </p>
          <p>
            <strong>Задачи:</strong>
          </p>
          <p>
            Описать предметную область и функционал разрабатываемой социальной
            сети для архитекторов;
          </p>
          <p>
            Провести обзор и анализ современных технологий для реализации
            проекта;
          </p>
          <p>
            Разработать прототип программного средства, социальной сети для
            архитекторов;
          </p>
          <p>Определить перспективы развития проекта.</p>
          <p>
            <strong>Этапы исследования:</strong>
            Определен функционал программного средства…
          </p>
          <p>
            Определен выбор информационных технологий. Язык программирования.
            Среда разработки. Фреймворки и библиотеки.
          </p>
          <p>
            Разработан графический интерфейс (Вкладки «Мой профиль», « Мои
            проекты», «Справочник», «Сообщения», «Настройки2, «О проекте».
            Строка верху страницы «Основные события», ниже под ней
            «Микроновости», большую часть страницы занимает содержание выбранной
            вкладки)
          </p>
          <p>
            <strong>Методы исследования и оборудование:</strong>
          </p>
          <p>
            Описание технологий для разработки социальной сети для архитекторов.
          </p>
          <p>
            Программное обеспечение планируется разрабатывать, использую клиент
            серверное приложение на основе технологии Rest API.
          </p>
          <p>
            Серверную часть приложения планируется выполнять на основе языка
            программирования C# в среде разработки Visual Studio 2022 с
            использованием фреймворка Asp. Net Core, а также библиотеки Json.NET
            – Newtonsoft.
          </p>
          <p>
            Клиентскую часть планируется выполнять также используя среду
            разработки Visual studio 2022 на языке программирования C#,
            <a href="https://www.newtonsoft.com/json">
              используя фреймворк Windows Forms .NET, а также бибилиотеки
              RestSharp и Json.NET – Newtonsoft.
            </a>
          </p>
          <p>
            <strong>Исправление ошибок:</strong>
          </p>
          <p>
            В ходе разработки остались невыясненными некоторые вопросы,
            связанные с форматом хранения данных, дополнительными функциями что
            будет дальнейшим направлением для исследования.
          </p>
          <p>
            <strong>Результаты:</strong>
          </p>
          <p>
            В результате была создана система, позволяющая пользователям
            делиться статьями, создавать новые и дополнять старые статьи, а
            также вести переписку в мессенджере, особенностями которой является
            специализация создания (узконаправленная категория потребителей —
            архитекторы, студенты), встроенный справочник.
          </p>
          <p>
            Использованы следующие информационные технологии: язык
            программирования C#, фреймворки Asp.Net Core и Windows Forms. NET,
            библиотеки Json.NET – Newtonsoft, RestShar, среда разработки Visual
            Studio 2022
          </p>
          <p>
            <strong>Перспективы проекта:</strong>
          </p>
          <p>
            Данный проект пригодится для архитекторов, студентов, обучающихся на
            архитектурном факультете, школьникам, интересующимися архитектурой.
          </p>
          <p>
            С помощью этого приложения пользователь может просматривать,
            сохранять, делиться статьями, дополнять их или создавать новые,
            загружать свои проекты в общий доступ, общаться.
          </p>
          <p>
            Выбор хостинга и платформы для распространения сервиса: глобальная
            сеть Интернет
          </p></q-card-section
        >
      </div>
    </q-card>
  </q-page>
</template>

<script>
import { defineComponent } from "vue";

export default defineComponent({
  name: "PageIndex",
});
</script>
<style lang="scss" scoped>
.main-panel {
  display: flex;
  flex-direction: cow;
  width: 100%;
  margin: 1em;
  padding: 1em;
  border: 1px;
  border-radius: 10px;
}
</style>
