<template>
  <q-page class="flex flex-left" v-if="userName">
    <q-card class="main-panel">
      <q-card-section>
        <q-card class="main-panel" style="width: 400px">
          <q-card-section>
            <h4>Справочник</h4>

            <ul>
              <li>
                <a
                  target="_blank"
                  href="https://catalog-plans.ru/article/encyclopedia-of-construction/arhitekturnyj-proekt"
                  ><h6>Стили</h6></a
                >
              </li>
              <li>
                <a
                  target="_blank"
                  href="https://catalog-plans.ru/article/encyclopedia-of-construction/arhitekturnyj-proekt"
                  ><h6>Элементы</h6></a
                >
              </li>
              <li>
                <a
                  target="_blank"
                  href="https://catalog-plans.ru/article/encyclopedia-of-construction/arhitekturnyj-proekt"
                  ><h6>Эпохи</h6></a
                >
              </li>
              <li>
                <a
                  target="_blank"
                  href="https://catalog-plans.ru/article/encyclopedia-of-construction/arhitekturnyj-proekt"
                  ><h6>Архитекторы</h6></a
                >
              </li>
            </ul>
          </q-card-section>
        </q-card>
      </q-card-section>
      <q-card-section>
        <q-card class="main-panel" style="width: 500px">
          <q-card-section>
            <q-card class="main-panel" style="width: 400px">
              <q-card-section
                ><a
                  target="_blank"
                  href="https://catalog-plans.ru/article/encyclopedia-of-construction/arhitekturnyj-proekt"
                >
                  <h5><b>Статья дня: </b>Что такое архитектурный проект?</h5></a
                >
              </q-card-section></q-card
            >
            <h6>ЧТО ТАКОЕ АРХИТЕКТУРНЫЙ ПРОЕКТ?</h6>
            <img
              src="~assets/paper1.jpg"
              style="width: 350px; height: 350px"
              class="main-img"
            />
            <p>
              Термин «архитектурный проект» используется повсеместно. Однако он
              не в полной мере корректен. Чтобы разобраться в этом, следует
              понять, что означает этот термин. Архитектурный проект –
              определение и особенности Архитектурный проект дома.
            </p>
            <p>
              Архитектурный проект – это часть проектной документации, которая
              разрабатывается профессиональным архитектором при подготовке к
              строительству. Поэтому правильнее использовать термины
              архитектурная часть, раздел или решения, так как полноценным
              проектом это не является.
            </p>

            <p>
              Тем не менее, понятие широко применяется в обиходе, даже
              профессиональными строителями и проектировщиками. Архитектурный
              проект дома состоит из двух частей. В состав первой (текстовой)
              входят следующие сведения: подробное описание внутреннего и
              внешнего облика проектируемого объекта и главных принципов его
              организации; обоснование принятых при выполнении проектных работ
              архитектурно-строительных решений; описание технологий отделки и
              применяемых при этом материалов; расчетные показатели
              естественного освещения и их соответствие требованиям действующих
              стандартов и правил; описание запланированных
              строительно-архитектурных мероприятий по защите здания от
              вибрации, шума и других негативных воздействий.
            </p>
            <p>
              Вторая часть (графическая) содержит: чертежи фасадов (вертикальные
              проекции наружной части дома); фасады в цвете и перспективе;
              поэтажные планы проектируемого здания (горизонтальные проекции
              дома); другие чертежи, если это предусмотрено требованиями задания
              на проектирование. Архитектурное проектирование – это обязательный
              этап создания проектной документации в целом, который выполняется
              специалистами-архитекторами на начальной стадии проектных работ.
            </p>
            <p>
              Требования и этапы архитектурного проектирования К архитектуре
              проекта предъявляется ряд требований: разработка в точном
              соответствии с техзаданием заказчика; соблюдение действующего
              градостроительного законодательства; выполнение требований и норм
              городской застройки и других правил, предусмотренных
              законодательством РФ. Разработка архитектурной части проекта, как
              правило, выполняется в три этапа. На первом этапе
              (подготовительном) производится сбор исходной информации с
              последующим анализом. Обязательно изучается: полученная
              разрешительная документация; кадастровые выписки и планы; наличие
              документов, подтверждающих право собственности; данные
              геологических изысканий; также выполняются необходимые замеры с
              целью составления обмерочных чертежей.
            </p>
            <p>
              На втором этапе (эскизном) принимаются основные проектные решения,
              касающиеся архитектурно-строительной части документации.
              Разрабатываются цветовые варианты фасадов, предварительные
              планировки. Как правило, полученные результаты согласовываются с
              заказчиком, который получает представление о будущей архитектуре
              проектируемого здания.
            </p>
            <p>
              Третий этап (завершающий) состоит из разработки рабочей
              технической документации с подробными конструктивными решениями.
              Состав комплекта необходимых чертежей и перечень выполняемых работ
              определяется требованиями задания на проектирование. Но он
              обязательно включает разделы с инженерными сетями. Строго говоря,
              данный этап не относится к архитектурной части проекта, однако,
              после выполнения всех необходимых разрезов, узлов и детальной
              проработке конструктивных решений нередко выполняется доработка и
              уточнение фасадов и планировок проектируемого дома с учетом всех
              деталей.
            </p>
            <a
              target="_blank"
              href="https://catalog-plans.ru/article/encyclopedia-of-construction/arhitekturnyj-proekt"
            >
              Ссылки на источник: Что такое архитектурный проект?</a
            >
          </q-card-section>
        </q-card>
      </q-card-section>
    </q-card>
  </q-page>

  <q-page class="flex flex-block" v-if="!userName">
    <h5>Необходима авторизация, пожалуйста авторизируйтесь</h5>
  </q-page>
</template>

<script>
import { computed, defineComponent } from "vue";
import { useStore } from "vuex";

export default {
  name: "IndexPage",
  setup() {
    const $store = useStore();
    const userName = computed({
      get: () => $store.state.mes.userName,
      set: (val) => {
        $store.commit("mes/updateUserNameState", val);
      },
    });
    return {
      $store,
      userName,
    };
  },
};
</script>
<style lang="scss" scoped>
.main-panel {
  display: flex;
  flex-direction: row;
  width: 100%;
  margin: 1em;
  padding: 1em;
  border: 1px;
  border-radius: 10px;
}
p {
  text-indent: 30px;
}
</style>
